
 function itemstr(action) {
    let str = "";
    for (item in action) {
        str += action[item];
    }
    return str;
}

let heartAction = {
    action_loop: "000A",       //动作循环次数，长度4
    frequency: "01",           //频率，长度2 1-10
    cycle_time: "03E8",        //周期时间，长度4 {1000ms}一个周期最大可以设65535 ：65s
    add_heat: "5A00640320",    //加热， 长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac1: "5A00640320",    //电机1，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac2: "5A00640320",    //电机2，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac3: "5A00640320",    //电机3，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac4: "5A00640320",    //电机4，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac5: "5A00640320",    //电机5，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    cmd:""
}
heartAction.cmd=itemstr(heartAction);


let action1 = {
    action_loop: "000A",       //动作循环次数，长度4
    frequency: "01",           //频率，长度2 1-10
    cycle_time: "03E8",        //周期时间，长度4 {1000ms}一个周期最大可以设65535 ：65s
    add_heat: "5A00640320",    //加热， 长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac1: "5A00640320",    //电机1，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac2: "5A00640320",    //电机2，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac3: "5A00640320",    //电机3，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac4: "5A00640320",    //电机4，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac5: "5A00640320",    //电机5，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    cmd:""
}
action1.cmd=itemstr(action1);

let action2 = {
    action_loop: "000A",       //动作循环次数，长度4
    frequency: "01",           //频率，长度2 1-10
    cycle_time: "03E8",        //周期时间，长度4 {1000ms}一个周期最大可以设65535 ：65s
    add_heat: "5A00640320",    //加热， 长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac1: "5A00640320",    //电机1，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac2: "5A00640320",    //电机2，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac3: "5A00640320",    //电机3，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac4: "5A00640320",    //电机4，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    ele_mac5: "5A00640320",    //电机5，长度10{占空比90,开始时间100ms,结束位置900ms }如果结束时间为0 ,周期结束时停止;
    cmd:""
}
action1.cmd=itemstr(action2);

